yongspan/GD32E230F8_Project/tools/GD32_ISP_CLI(Windows)_V5.1.0.39034/GD32_ISP_CLI(Windows)_V5.1.0.39034/OptionBytesXML/GD32H7xx.xml
            </field>
			<field>
                <name>WP[5]</name>
                <brief>0x8050000~0x805FFFF</brief>
                <description>each bit reflects the corresponding 16 sectors to erase/program protection status.&#x000A;0: corresponding 16 sectors are erase/program protected.&#x000A;1: corresponding 16 sectors are not erase/program protected</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
			<field>
                <name>WP[4]</name>
                <brief>0x8040000~0x804FFFF</brief>
                <description>each bit reflects the corresponding 16 sectors to erase/program protection status.&#x000A;0: corresponding 16 sectors are erase/program protected.&#x000A;1: corresponding 16 sectors are not erase/program protected</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
			<field>
                <name>WP[3]</name>
                <brief>0x8030000~0x803FFFF</brief>
                <description>each bit reflects the corresponding 16 sectors to erase/program protection status.&#x000A;0: corresponding 16 sectors are erase/program protected.&#x000A;1: corresponding 16 sectors are not erase/program protected</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
			<field>
                <name>WP[2]</name>
                <brief>0x8020000~0x802FFFF</brief>
                <description>each bit reflects the corresponding 16 sectors to erase/program protection status.&#x000A;0: corresponding 16 sectors are erase/program protected.&#x000A;1: corresponding 16 sectors are not erase/program protected</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
			<field>
                <name>WP[1]</name>
                <brief>0x8010000~0x801FFFF</brief>
                <description>each bit reflects the corresponding 16 sectors to erase/program protection status.&#x000A;0: corresponding 16 sectors are erase/program protected.&#x000A;1: corresponding 16 sectors are not erase/program protected</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
			<field>
                <name>WP[0]</name>
                <brief>0x8000000~0x800FFFF</brief>
                <description>each bit reflects the corresponding 16 sectors to erase/program protection status.&#x000A;0: corresponding 16 sectors are erase/program protected.&#x000A;1: corresponding 16 sectors are not erase/program protected</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
		</fields>
    </OPByte>
	<OPByte>
		<name>FMC_WP_MDF</name>
		<displayName>FMC_WP_MDF</displayName>
		<addressOffset>0x20</addressOffset>
		<size>0x20</size>
		<access>read-write</access>
		<reset>0x00000000</reset>	
		<complement>FFFF</complement>
		<fields>
			<field>
                <name>WP[21]</name>
                <brief>0x8380000~0x83BFFFF</brief>
                <description>each bit reflects the corresponding 64 sectors to erase/program protection status.&#x000A;0: corresponding 64 sectors are erase/program protected.&#x000A;1: corresponding 64 sectors are not erase/program protected</description>
                <bitOffset>21</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
			<field>
                <name>WP[20]</name>
                <brief>0x8300000~0x837FFFF</brief>
                <description>each bit reflects the corresponding 128 sectors to erase/program protection status.&#x000A;0: corresponding 128 sectors are erase/program protected.&#x000A;1: corresponding 128 sectors are not erase/program protected</description>
                <bitOffset>20</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
			<field>
                <name>WP[19]</name>
                <brief>0x8280000~0x82FFFFF</brief>
                <description>each bit reflects the corresponding 128 sectors to erase/program protection status.&#x000A;0: corresponding 128 sectors are erase/program protected.&#x000A;1: corresponding 128 sectors are not erase/program protected</description>
                <bitOffset>19</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
			<field>
                <name>WP[18]</name>
                <brief>0x8200000~0x827FFFF</brief>
                <description>each bit reflects the corresponding 128 sectors to erase/program protection status.&#x000A;0: corresponding 128 sectors are erase/program protected.&#x000A;1: corresponding 128 sectors are not erase/program protected</description>
                <bitOffset>18</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
			<field>
                <name>WP[17]</name>
                <brief>0x8180000~0x81FFFFF</brief>
                <description>each bit reflects the corresponding 128 sectors to erase/program protection status.&#x000A;0: corresponding 128 sectors are erase/program protected.&#x000A;1: corresponding 128 sectors are not erase/program protected</description>
                <bitOffset>17</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
			<field>
                <name>WP[16]</name>
                <brief>0x8100000~0x817FFFF</brief>
                <description>each bit reflects the corresponding 128 sectors to erase/program protection status.&#x000A;0: corresponding 128 sectors are erase/program protected.&#x000A;1: corresponding 128 sectors are not erase/program protected</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
			<field>
                <name>WP[15]</name>
                <brief>0x80F0000~0x80FFFFF</brief>
                <description>each bit reflects the corresponding 16 sectors to erase/program protection status.&#x000A;0: corresponding 16 sectors are erase/program protected.&#x000A;1: corresponding 16 sectors are not erase/program protected</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
			<field>
                <name>WP[14]</name>
                <brief>0x80E0000~0x80EFFFF</brief>
                <description>each bit reflects the corresponding 16 sectors to erase/program protection status.&#x000A;0: corresponding 16 sectors are erase/program protected.&#x000A;1: corresponding 16 sectors are not erase/program protected</description>
                <bitOffset>14</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
			<field>
                <name>WP[13]</name>
                <brief>0x80D0000~0x80DFFFF</brief>
                <description>each bit reflects the corresponding 16 sectors to erase/program protection status.&#x000A;0: corresponding 16 sectors are erase/program protected.&#x000A;1: corresponding 16 sectors are not erase/program protected</description>
                <bitOffset>13</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
			<field>
                <name>WP[12]</name>
                <brief>0x80C0000~0x80CFFFF</brief>
                <description>each bit reflects the corresponding 16 sectors to erase/program protection status.&#x000A;0: corresponding 16 sectors are erase/program protected.&#x000A;1: corresponding 16 sectors are not erase/program protected</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
			<field>
                <name>WP[11]</name>
                <brief>0x80B0000~0x80BFFFF</brief>
                <description>each bit reflects the corresponding 16 sectors to erase/program protection status.&#x000A;0: corresponding 16 sectors are erase/program protected.&#x000A;1: corresponding 16 sectors are not erase/program protected</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
			<field>
                <name>WP[10]</name>
                <brief>0x80A0000~0x80AFFFF</brief>
                <description>each bit reflects the corresponding 16 sectors to erase/program protection status.&#x000A;0: corresponding 16 sectors are erase/program protected.&#x000A;1: corresponding 16 sectors are not erase/program protected</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
			<field>
                <name>WP[9]</name>
                <brief>0x8090000~0x809FFFF</brief>
                <description>each bit reflects the corresponding 16 sectors to erase/program protection status.&#x000A;0: corresponding 16 sectors are erase/program protected.&#x000A;1: corresponding 16 sectors are not erase/program protected</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
			<field>
                <name>WP[8]</name>
                <brief>0x8080000~0x808FFFF</brief>
                <description>each bit reflects the corresponding 16 sectors to erase/program protection status.&#x000A;0: corresponding 16 sectors are erase/program protected.&#x000A;1: corresponding 16 sectors are not erase/program protected</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
			<field>
                <name>WP[7]</name>
                <brief>0x8070000~0x807FFFF</brief>
                <description>each bit reflects the corresponding 16 sectors to erase/program protection status.&#x000A;0: corresponding 16 sectors are erase/program protected.&#x000A;1: corresponding 16 sectors are not erase/program protected</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
			<field>
                <name>WP[6]</name>
                <brief>0x8060000~0x806FFFF</brief>
                <description>each bit reflects the corresponding 16 sectors to erase/program protection status.&#x000A;0: corresponding 16 sectors are erase/program protected.&#x000A;1: corresponding 16 sectors are not erase/program protected</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
			<field>
                <name>WP[5]</name>
                <brief>0x8050000~0x805FFFF</brief>
                <description>each bit reflects the corresponding 16 sectors to erase/program protection status.&#x000A;0: corresponding 16 sectors are erase/program protected.&#x000A;1: corresponding 16 sectors are not erase/program protected</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
			<field>
                <name>WP[4]</name>
                <brief>0x8040000~0x804FFFF</brief>
                <description>each bit reflects the corresponding 16 sectors to erase/program protection status.&#x000A;0: corresponding 16 sectors are erase/program protected.&#x000A;1: corresponding 16 sectors are not erase/program protected</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
			<field>
                <name>WP[3]</name>
                <brief>0x8030000~0x803FFFF</brief>
                <description>each bit reflects the corresponding 16 sectors to erase/program protection status.&#x000A;0: corresponding 16 sectors are erase/program protected.&#x000A;1: corresponding 16 sectors are not erase/program protected</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
			<field>
                <name>WP[2]</name>
                <brief>0x8020000~0x802FFFF</brief>
                <description>each bit reflects the corresponding 16 sectors to erase/program protection status.&#x000A;0: corresponding 16 sectors are erase/program protected.&#x000A;1: corresponding 16 sectors are not erase/program protected</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
			<field>
                <name>WP[1]</name>
                <brief>0x8010000~0x801FFFF</brief>
                <description>each bit reflects the corresponding 16 sectors to erase/program protection status.&#x000A;0: corresponding 16 sectors are erase/program protected.&#x000A;1: corresponding 16 sectors are not erase/program protected</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
			<field>
                <name>WP[0]</name>
                <brief>0x8000000~0x800FFFF</brief>
                <description>each bit reflects the corresponding 16 sectors to erase/program protection status.&#x000A;0: corresponding 16 sectors are erase/program protected.&#x000A;1: corresponding 16 sectors are not erase/program protected</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
		</fields>
    </OPByte>
	<OPByte>
		<name>FMC_BTADDR_EFT</name>
		<displayName>FMC_BTADDR_EFT</displayName>
		<addressOffset>0x24</addressOffset>
		<size>0x20</size>
		<access>read</access>
		<reset>0x00000000</reset>	
		<complement>FFFF</complement>
		<fields>
			<field>
				<name>BOOT_ADDR1[15:0]</name>
				<brief>Boot address 1 status bits</brief>
				<description>Boot address 1 status bits&#x000A;MSB of the boot address if BOOT pin is high.</description>
				<bitOffset>16</bitOffset>
				<bitWidth>16</bitWidth>
			</field>
			<field>
				<name>BOOT_ADDR0[15:0]</name>
				<brief>Boot address 0 status bits</brief>
				<description>Boot address 0 status bits&#x000A;MSB of the boot address if BOOT pin is low.</description>
				<bitOffset>0</bitOffset>
				<bitWidth>16</bitWidth>
			</field>
		</fields>
    </OPByte>
	<OPByte>
		<name>FMC_BTADDR_MDF</name>
		<displayName>FMC_BTADDR_MDF</displayName>
		<addressOffset>0x28</addressOffset>
		<size>0x20</size>
		<access>read-write</access>
		<reset>0x00000000</reset>	
		<complement>FFFF</complement>
		<fields>
			<field>
				<name>BOOT_ADDR1[15:0]</name>
				<brief>Boot address 1 configuration bits</brief>
				<description>Boot address 1 configuration bits.&#x000A;Configure the MSB of boot address if the BOOT pin is high.</description>
				<bitOffset>16</bitOffset>
				<bitWidth>16</bitWidth>
			</field>
			<field>
				<name>BOOT_ADDR0[15:0]</name>
				<brief>Boot address 0 configuration bits</brief>
				<description>Boot address 0 configuration bits.&#x000A;Configure the MSB of the boot address if the BOOT pin is low.</description>
				<bitOffset>0</bitOffset>
				<bitWidth>16</bitWidth>
			</field>
		</fields>
    </OPByte>
    <OPByte>
		<name>FMC_OBSTAT1_EFT</name>
		<displayName>FMC_OBSTAT1_EFT</displayName>
		<addressOffset>0x34</addressOffset>
		<size>0x20</size>
		<access>read</access>
		<reset>0x00000000</reset>	
		<complement>FFFF</complement>
		<fields>
			<field>
				<name>DATA[15:0]</name>
				<brief>User defined option byte data status value</brief>
				<description>User defined option byte data status value</description>
				<bitOffset>16</bitOffset>
				<bitWidth>16</bitWidth>
			</field>
			<field>
				<name>DTCM_SZ_SHRRAM[3:0]</name>
				<brief>DTCM size of shared RAM status bits</brief>
				<description>DTCM size of shared RAM status bits.&#x000A;DTCM + ITCM can not be more than 512Kbyte &#x000A;0000: 0-byte DTCM&#x000A;0111: 64-Kbyte DTCM&#x000A;1000: 128-Kbyte DTCM&#x000A;1001: 256-Kbyte DTCM&#x000A;1010: 512-Kbyte DTCM</description>
				<bitOffset>4</bitOffset>
				<bitWidth>4</bitWidth>
			</field>
			<field>
				<name>ITCM_SZ_SHRRAM[3:0]</name>
				<brief>ITCM size of shared RAM status bits</brief>
				<description>ITCM size of shared RAM status bits.&#x000A;DTCM + ITCM can not be more than 512Kbyte&#x000A;0000: 0-byte ITCM&#x000A;0111: 64-Kbyte ITCM&#x000A;1000: 128-Kbyte ITCM&#x000A;1001: 256-Kbyte ITCM&#x000A;1010: 512-Kbyte ITCM</description>
				<bitOffset>0</bitOffset>
				<bitWidth>4</bitWidth>
			</field>
		</fields>
    </OPByte>	
	<OPByte>
		<name>FMC_OBSTAT1_MDF</name>
		<displayName>FMC_OBSTAT1_MDF</displayName>
		<addressOffset>0x38</addressOffset>
		<size>0x20</size>
		<access>read-write</access>
		<reset>0x00000000</reset>	
		<complement>FFFF</complement>
		<fields>
			<field>
				<name>DATA[15:0]</name>
				<brief>User defined option byte data configuration value</brief>
				<description>User defined option byte data configuration value</description>
				<bitOffset>16</bitOffset>
				<bitWidth>16</bitWidth>
			</field>
			<field>
				<name>DTCM_SZ_SHRRAM[3:0]</name>
				<brief>DTCM size of shared RAM configuration bits</brief>
				<description>DTCM size of shared RAM configuration bits.&#x000A;DTCM + ITCM can not be more than 512Kbyte&#x000A;0000: 0-byte DTCM&#x000A;0111: 64-Kbyte DTCM&#x000A;1000: 128-Kbyte DTCM&#x000A;1001: 256-Kbyte DTCM&#x000A;1010: 512-Kbyte DTCM</description>
				<bitOffset>4</bitOffset>
				<bitWidth>4</bitWidth>
			</field>
			<field>
				<name>ITCM_SZ_SHRRAM[3:0]</name>
				<brief>ITCM size of shared RAM configuration bits</brief>
				<description>ITCM size of shared RAM configuration bits.&#x000A;DTCM + ITCM can not be more than 512Kbyte&#x000A;0000: 0-byte ITCM&#x000A;0111: 64-Kbyte ITCM&#x000A;1000: 128-Kbyte ITCM&#x000A;1001: 256-Kbyte ITCM&#x000A;1010: 512-Kbyte ITCM</description>
				<bitOffset>0</bitOffset>
				<bitWidth>4</bitWidth>
			</field>
		</fields>
    </OPByte>	
</OPBytes>
<OPBytes baseAddress="0x52002068" length="24" RegType="OptionBytes">
	<OPByte>
		<name>FMC_AESIV0_EFT</name>
		<displayName>FMC_AESIV0_EFT</displayName>
		<addressOffset>0x00</addressOffset>
		<size>0x20</size>
		<access>read</access>
		<reset>0x00000000</reset>	
		<complement>FFFF</complement>
		<fields>
			<field>
                <name>AESIV0_ETF[31:0]</name>
                <brief>AES initialization vector configuration value.</brief>
                <description>AES initialization vector configuration value.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
            </field>
		</fields>
    </OPByte>	
	<OPByte>
		<name>FMC_AESIV1_EFT</name>
		<displayName>FMC_AESIV1_EFT</displayName>
		<addressOffset>0x04</addressOffset>
		<size>0x20</size>
		<access>read</access>
		<reset>0x00000000</reset>	
		<complement>FFFF</complement>
		<fields>
			<field>
                <name>AESIV1_ETF[31:0]</name>
                <brief>AES initialization vector configuration value.</brief>
                <description>AES initialization vector configuration value.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
            </field>
		</fields>
    </OPByte>	
	<OPByte>
		<name>FMC_AESIV2_EFT</name>
		<displayName>FMC_AESIV2_EFT</displayName>
		<addressOffset>0x08</addressOffset>
		<size>0x20</size>
		<access>read</access>
		<reset>0x00000000</reset>	
		<complement>FFFF</complement>
		<fields>
			<field>
                <name>AESIV2_ETF[31:0]</name>
                <brief>AES initialization vector configuration value.</brief>
                <description>AES initialization vector configuration value.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
            </field>
		</fields>
    </OPByte>	
	<OPByte>
		<name>FMC_AESIV0_MDF</name>
		<displayName>FMC_AESIV0_MDF</displayName>
		<addressOffset>0x0C</addressOffset>
		<size>0x20</size>
		<access>read-write</access>
		<reset>0x00000000</reset>	
		<complement>FFFF</complement>
		<fields>
			<field>
                <name>AESIV0_MDF[31:0]</name>
                <brief>AES initialization vector configuration value.</brief>
                <description>AES initialization vector configuration value.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
            </field>
		</fields>
    </OPByte>	
	<OPByte>
		<name>FMC_AESIV1_MDF</name>
		<displayName>FMC_AESIV1_MDF</displayName>
		<addressOffset>0x10</addressOffset>
		<size>0x20</size>
		<access>read-write</access>
		<reset>0x00000000</reset>	
		<complement>FFFF</complement>
		<fields>
			<field>
                <name>AESIV1_MDF[31:0]</name>
                <brief>AES initialization vector configuration value.</brief>
                <description>AES initialization vector configuration value.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
            </field>
		</fields>
    </OPByte>	
	<OPByte>
		<name>FMC_AESIV2_MDF</name>
		<displayName>FMC_AESIV2_MDF</displayName>
		<addressOffset>0x14</addressOffset>
		<size>0x20</size>
		<access>read-write</access>
		<reset>0x00000000</reset>	
		<complement>FFFF</complement>
		<fields>
			<field>
                <name>AESIV2_MDF[31:0]</name>
                <brief>AES initialization vector configuration value.</brief>
                <description>AES initialization vector configuration value.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
            </field>
		</fields>
    </OPByte>	
</OPBytes>
<OPBytes baseAddress="0x40022814" length="48" RegType="Efuse">
	<OPByte>
		<name>EFUSE_USER_CTL</name>
		<displayName>EFUSE_USER_CTL</displayName>
		<addressOffset>0x0</addressOffset>
		<size>0x20</size>
		<access>read-write</access>
		<complement>FFFF</complement>
		<fields>
			<field>
                <name>SCR_AREA_END[7:0]</name>
                <brief>Secure-access area end address bits</brief>
                <description>Secure-access area end address bits</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
            </field>
			<field>
                <name>SCR_AREA_START[7:0]</name>
                <brief>Secure-access area start address bits</brief>
                <description>Secure-access area start address bits</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
            </field>
			<field>
                <name>SCR_EFUSE</name>
                <brief>Secure access mode enable</brief>
                <description>0: Disable secure access mode&#x000A;1: Enable secure access mode</description>
                <bitOffset>13</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
			<field>
                <name>SPC_H</name>
                <brief>Configure security protection to level high</brief>
                <description>If SPC_H and SPC_L in efuse macro are both 1, SPC is level high</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
			<field>
                <name>SPC_L</name>
                <brief>Configure security protection to level low</brief>
                <description>If SPC_L in efuse macro is 1, SPC level low to no protection demotion is forbidden. If SPC_H and SPC_L in efuse macro are both set, SPC is level high.</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
			<field>
                <name>JTAGNSW</name>
                <brief>SW or JTAG debugger select</brief>
                <description>0: SW&#x000A;1: JTAG</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
			<field>
                <name>NDBG[1:0]</name>
                <brief>Debugging permission setting</brief>
                <description>00: Normal JTAG&#x000A;01: Secure JTAG&#x000A;10: No debug&#x000A;11: No debug</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
            </field>
			<field>
                <name>UDLK</name>
                <brief>EFUSE_USER_DATAx register lock bit</brief>
