yongspan/GD32E230F8_Project/tools/GD32_ISP_CLI(Windows)_V5.1.0.39034/GD32_ISP_CLI(Windows)_V5.1.0.39034/OptionBytesXML/GD32H7xx.xml
				<description>0: Unlock EFUSE_USER_DATAx register, the register can be modified&#x000A;1: Lock EFUSE_USER_DATAx register, the register can not be modified</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
			<field>
                <name>AESEN</name>
                <brief>Lock EFUSE_AES_KEYx register and enable AES decrypt function</brief>
				<description>0: Disable AES decrypt and AES key can be written&#x000A;1: Enable AES decrypt and AES key can’t be written</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
			<field>
                <name>UCLK</name>
                <brief>Low 16 bits of EFUSE_USER_CTL register lock bit</brief>
				<description>0: Unlock the low 16 bits of EFUSE_USER_CTL register, the bits can be modified&#x000A;1: Lock the low 16 bits of EFUSE_USER_CTL register, the bits can not be modified</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
			<field>
                <name>SCRLK</name>
                <brief>Secure access area address lock bit</brief>
				<description>0: Unlock the high 16 bits in EFUSE_USER_CTL register, the bits can be modified&#x000A;1: Lock the high 16 bits in EFUSE_USER_CTL register, the bits can not be modified</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
			<field>
                <name>DPLK</name>
                <brief>EFUSE_DPx register lock bit</brief>
				<description>0: Unlock EFUSE_DPx register, the register can be written or read&#x000A;1: Lock EFUSE_DPx register, the register can not be written</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
		</fields>
    </OPByte>
	<OPByte>
		<name>EFUSE_MCU_RSV</name>
		<displayName>EFUSE_MCU_RSV</displayName>
		<addressOffset>0x04</addressOffset>
		<size>0x20</size>
		<access>read-write</access>
		<complement>FFFF</complement>
		<fields>
			<field>
                <name>DCRP_AREA_END[7:0]</name>
                <brief>DCRP area end address bits</brief>
                <description>DCRP area end address bits</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
            </field>
			<field>
                <name>DCRP_AREA_START[7:0]</name>
                <brief>DCRP area start address bits</brief>
                <description>DCRP area start address bits</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
            </field>
			<field>
                <name>MCU_RSV[5:0]</name>
                <brief>MCU reserved data</brief>
				<description>MCU reserved data</description>
                <bitOffset>10</bitOffset>
                <bitWidth>6</bitWidth>
            </field>
			<field>
                <name>DCRPLK</name>
                <brief>DCRP area address lock bit</brief>
                <description>0: Unlock the high 16 bits in EFUSE_MCU_RSV register, the bits can be modified&#x000A;1: Lock the high 16 bits in EFUSE_MCU_RSV register, the bits can not be modified</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
			<field>
                <name>MCURSVLK</name>
                <brief>Low 16 bits of EFUSE_MCU_RSV register lock bit</brief>
                <description>0: Unlock the low 16 bits of EFUSE_MCU_RSV register, the bits can be modified&#x000A;1: Lock the low 16 bits of EFUSE_MCU_RSV register, the bits can not be modified</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
			<field>
                <name>VFIMG</name>
                <brief>Firmware image verification enable bit</brief>
                <description>0: Disable firmware image verification&#x000A;1: Enable firmware image verification</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
			<field>
                <name>DISLFI</name>
                <brief>Licensed firmware install ( LFI ) disable</brief>
                <description>0: Enable licensed firmware install&#x000A;1: Disable licensed firmware install</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
			<field>
                <name>AESNCAU</name>
                <brief>AES key for cau configuration bit</brief>
                <description>0: The AES key can be used for CAU&#x000A;1: The AES key cannot be used for CAU</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
		</fields>
    </OPByte>
	<OPByte>
		<name>EFUSE_DP0</name>
		<displayName>EFUSE_DP0</displayName>
		<addressOffset>0x08</addressOffset>
		<size>0x20</size>
		<access>read-write</access>
		<complement>FFFF</complement>
		<fields>
			<field>
                <name>DP0[31:0]</name>
                <brief>Efuse debug password value</brief>
                <description>Efuse debug password value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
            </field>
		</fields>
    </OPByte>
	<OPByte>
		<name>EFUSE_DP1</name>
		<displayName>EFUSE_DP1</displayName>
		<addressOffset>0x0C</addressOffset>
		<size>0x20</size>
		<access>read-write</access>
		<complement>FFFF</complement>
		<fields>
			<field>
                <name>DP1[31:0]</name>
                <brief>Efuse debug password value</brief>
                <description>Efuse debug password value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
            </field>
		</fields>
    </OPByte>
	<OPByte>
	<name>EFUSE_AES_KEY0</name>
		<displayName>EFUSE_AES_KEY0</displayName>
		<addressOffset>0x10</addressOffset>
		<size>0x20</size>
		<access>write</access>
		<complement>FFFF</complement>
		<fields>
			<field>
                <name>AESKEY0[31:0]</name>
                <brief>Efuse AESKEY0 value.</brief>
                <description>Efuse AESKEY0 value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
            </field>
		</fields>
    </OPByte>
	<OPByte>
		<name>EFUSE_AES_KEY1</name>
		<displayName>EFUSE_AES_KEY1</displayName>
		<addressOffset>0x14</addressOffset>
		<size>0x20</size>
		<access>write</access>
		<complement>FFFF</complement>
		<fields>
			<field>
                <name>AESKEY1[31:0]</name>
                <brief>Efuse AESKEY1 value.</brief>
                <description>Efuse AESKEY1 value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
            </field>
		</fields>
    </OPByte>
	<OPByte>
		<name>EFUSE_AES_KEY2</name>
		<displayName>EFUSE_AES_KEY2</displayName>
		<addressOffset>0x18</addressOffset>
		<size>0x20</size>
		<access>write</access>
		<complement>FFFF</complement>
		<fields>
			<field>
                <name>AESKEY2[31:0]</name>
                <brief>Efuse AESKEY2 value.</brief>
                <description>Efuse AESKEY2 value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
            </field>
		</fields>
    </OPByte>
	<OPByte>
		<name>EFUSE_AES_KEY3</name>
		<displayName>EFUSE_AES_KEY3</displayName>
		<addressOffset>0x1C</addressOffset>
		<size>0x20</size>
		<access>write</access>
		<complement>FFFF</complement>
		<fields>
			<field>
                <name>AESKEY3[31:0]</name>
                <brief>Efuse AESKEY3 value.</brief>
                <description>Efuse AESKEY3 value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
            </field>
		</fields>
    </OPByte>
	<OPByte>
		<name>USERDATA0</name>
		<displayName>USERDATA0</displayName>
		<addressOffset>0x20</addressOffset>
		<size>0x20</size>
		<access>read-write</access>
		<complement>FFFF</complement>
		<fields>
			<field>
                <name>USERDATA0[31:0]</name>
                <brief>Efuse USER_DATA0 value</brief>
                <description>Efuse USER_DATA0 value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
            </field>
		</fields>
    </OPByte>
	<OPByte>
		<name>USERDATA1</name>
		<displayName>USERDATA1</displayName>
		<addressOffset>0x24</addressOffset>
		<size>0x20</size>
		<access>read-write</access>
		<complement>FFFF</complement>
		<fields>
			<field>
                <name>USERDATA1[31:0]</name>
                <brief>Efuse USER_DATA1 value</brief>
                <description>Efuse USER_DATA1 value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
            </field>
		</fields>
    </OPByte>
	<OPByte>
		<name>USERDATA2</name>
		<displayName>USERDATA2</displayName>
		<addressOffset>0x28</addressOffset>
		<size>0x20</size>
		<access>read-write</access>
		<complement>FFFF</complement>
		<fields>
			<field>
                <name>USERDATA2[31:0]</name>
                <brief>Efuse USER_DATA2 value</brief>
                <description>Efuse USER_DATA2 value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
            </field>
		</fields>
    </OPByte>
	<OPByte>
		<name>USERDATA3</name>
		<displayName>USERDATA3</displayName>
		<addressOffset>0x2C</addressOffset>
		<size>0x20</size>
		<access>read-write</access>
		<complement>FFFF</complement>
		<fields>
			<field>
                <name>USERDATA3[31:0]</name>
                <brief>Efuse USER_DATA3 value</brief>
                <description>Efuse USER_DATA3 value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
            </field>
		</fields>
    </OPByte>
</OPBytes>